tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"
tap "productdevbook/tap"
tap "showwin/speedtest"
tap "spring-io/tap"
tap "sst/tap"
tap "xo/xo"
brew "age"
brew "autoconf"
brew "automake"
brew "node"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "bash-language-server"
brew "bat"
brew "bazel"
brew "bottom"
brew "bruno-cli"
brew "carapace"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "libtool"
brew "composer"
brew "dbmate"
brew "deno"
brew "diff-so-fancy"
brew "docker-buildx"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "docker-ls"
brew "dockerfile-language-server"
brew "doppler"
brew "dotnet"
brew "duckdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "golang-migrate"
brew "gopls"
brew "graphviz"
brew "helix"
brew "helm"
brew "httpie"
brew "hyperfine"
brew "jprq"
brew "k6"
brew "kubernetes-cli"
brew "libpostal"
brew "llvm"
brew "lld"
brew "lua-language-server"
brew "luarocks"
brew "markdown-oxide"
brew "marksman"
brew "openjdk"
brew "maven"
brew "minikube"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "onefetch"
brew "openfortivpn"
brew "openjdk@11"
brew "osm2pgsql"
brew "pandoc"
brew "parallel"
brew "pkgconf"
brew "poppler"
brew "postgresql@16"
brew "postgresql@17"
brew "pv"
brew "qemu"
brew "r"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "scc"
brew "serverless"
brew "sevenzip"
brew "spring-completion", link: false
brew "sqlc"
brew "sqlfluff"
brew "starship"
brew "tag"
brew "taplo"
brew "terraform-ls"
brew "tinymist"
brew "tmux"
brew "tokei"
brew "typescript-language-server"
brew "typst"
brew "uv"
brew "vercel-cli"
brew "vscode-langservers-extracted"
brew "wget"
brew "yaml-language-server"
brew "zig"
brew "zls"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "showwin/speedtest/speedtest"
brew "spring-io/tap/spring-boot"
brew "sst/tap/sst"
brew "xo/xo/usql"
cask "affinity"
cask "blender"
cask "claude-code"
cask "docker-desktop"
cask "font-eb-garamond"
cask "font-jetbrains-mono-nerd-font"
cask "font-latin-modern-math"
cask "font-new-computer-modern"
cask "font-stix-two-math"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "goreleaser"
cask "karabiner-elements"
cask "keycastr"
cask "portkiller"
cask "spotify"
cask "tableplus"
cask "tailscale-app"
cask "vlc"
cask "whatsapp"
cask "zoom"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/melkeydev/go-blueprint"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/gopls/internal/analysis/modernize/cmd/modernize"
go "github.com/dim13/otpauth"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
